Тест1/src/Documents/РезервЗапчастей/РезервЗапчастей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РезервЗапчастей</name>
  <registerRecords>AccumulationRegister.Резерв</registerRecords>
  <registerRecords>AccumulationRegister.РегистрНакопления1</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>CatalogRef.Доставка</types>
    </type>
  </attributes>
  <attributes>
    <name>Расход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПроверки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоРекв</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КтоПродал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Оплачено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УжеОплачено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Откат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомуОткат</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Таблица</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>машина</name>
      <type>
        <types>CatalogRef.Машины</types>
      </type>
    </attributes>
    <attributes>
      <name>цена1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест1/src/Documents/РезервЗапчастей/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура Печатать(Команда)
	
	ТабДокумент = ПечататьСервер();
	ТабДокумент.Показать();
	
КонецПроцедуры

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервере
Функция ПечататьСервер()

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб = Истина;
	Макет       =   ПолучитьМакет("ТоварнаяНакладная");
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстЗаголовка = "Товарная Накладная № "+Объект.Номер;
	ОбластьМакета.Параметры.Дата = Объект.Дата;
	ОбластьМакета.Параметры.Покупатель = Объект.Клиент.ФИО;
	ОбластьМакета.Параметры.Адрес = Объект.Клиент.Страна + ", " + Объект.Клиент.Город;
	ОбластьМакета.Параметры.Телефон = Объект.Клиент.Телефон;
	ТабДокумент.Вывести(ОбластьМакета); 
	ОбластьМакета = Макет.ПолучитьОбласть("заголовок2");
	ТабДокумент.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("шапка");
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьСтроки = Макет.ПолучитьОбласть("Строка");
	
	НомерСтроки = 0;
	
	Итого = 0;
	Скидка = 0;
	Для Каждого СтрокаТабличнойЧасти Из Объект.Таблица Цикл

		НомерСтроки = НомерСтроки + 1;
		
		ОбластьСтроки.Параметры.код = СтрокаТабличнойЧасти.Товар.Код; 
		ОбластьСтроки.Параметры.артикул = СтрокаТабличнойЧасти.Товар.Артикул;
		//ОбластьСтроки.Параметры.нпроизв = СтрокаТабличнойЧасти.Товар.НомерПроизводителя;
		ОбластьСтроки.Параметры.машина = СтрокаТабличнойЧасти.Машина.Код;
		ОбластьСтроки.Параметры.наименование = СтрокаТабличнойЧасти.Товар.Наименование;
		Скидка1 = 0;
		Если(СтрДлина(СтрокаТабличнойЧасти.Комментарий)>2) Тогда
			ОбластьСтроки.Параметры.наименование = ОбластьСтроки.Параметры.наименование + ", " + СтрокаТабличнойЧасти.Комментарий;
		КонецЕсли;
		
		ОбластьСтроки.Параметры.цена = СтрокаТабличнойЧасти.Цена;
		ОбластьСтроки.Параметры.колво = СтрокаТабличнойЧасти.Количество;
		
		Итого = Итого + СтрокаТабличнойЧасти.Цена*СтрокаТабличнойЧасти.Количество;
		Если СтрокаТабличнойЧасти.Скидка <> Null И СтрокаТабличнойЧасти.Скидка > 0 Тогда
			Скидка = Скидка + СтрокаТабличнойЧасти.Скидка;
			Скидка1 = СтрокаТабличнойЧасти.Скидка;
		Иначе
			Скидка = Скидка + (СтрокаТабличнойЧасти.Цена*СтрокаТабличнойЧасти.Количество)*(Объект.Клиент.Скидка/100);
			Скидка1 = (СтрокаТабличнойЧасти.Цена*СтрокаТабличнойЧасти.Количество)*(Объект.Клиент.Скидка/100);
		КонецЕсли;
		ОбластьСтроки.Параметры.сумма = СтрокаТабличнойЧасти.Цена*СтрокаТабличнойЧасти.Количество - Скидка1;
		//ОбластьСтроки.Параметры.скидка = Скидка1; 
		
		ТабДокумент.Вывести(ОбластьСтроки);

	КонецЦикла;

	ОбластьМакета = Макет.ПолучитьОбласть("подвал");
	ОбластьМакета.Параметры.СрокПроверки = "" + Объект.СрокПроверки + " дней";
	ОбластьМакета.Параметры.доставка = "" + Объект.Доставка;
	ОбластьМакета.Параметры.расход = "" + Объект.Расход + " р.";
	ОбластьМакета.Параметры.ИтогоСумма = "" + Итого + " р.";
	ОбластьМакета.Параметры.Скидка = "" + Скидка+ " р.";
    ОбластьМакета.Параметры.Итого = "" + (Итого - Скидка)+ " р.";
	ОбластьМакета.Параметры.Продавец = Объект.КтоПродал.ФИО;
	ТабДокумент.Вывести(ОбластьМакета);
	
	Возврат ТабДокумент;

КонецФункции // ПечататьСервер()

&НаСервере
Функция ПолучитьМакет(название)
	Возврат  Документы.ПродажаЗапчастей.ПолучитьМакет(название);
КонецФункции

&НаКлиенте
Процедура Добавить(Команда)
	Форма = ПолучитьФорму("Обработка.ВыборНоменклатуры.Форма");
	Форма.ВладелецФормы = ЭтаФорма;       
	Форма.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	// Вставить содержимое обработчика.
	Перем Команда;
	Перем деталь;
	Перем код;

	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		ВыбранноеЗначение.Свойство("Команда", Команда);
        Если Команда = "ПравильныйПоиск"   Тогда
           ВыбранноеЗначение.Свойство("Код", код);
		   ВыбранноеЗначение.Свойство("деталь", деталь);
		   ДобавлениеЗапчасти(код,деталь);
	   КонецЕсли
   КонецЕсли     
КонецПроцедуры

&НаСервере
Процедура  ДобавлениеЗапчасти(код,деталь)
	 Товар = Справочники.Номенклатура.НайтиПоКоду(код);
	 Строка = Объект.Таблица.Добавить();
	 Строка.Товар = Товар;
	 Строка.Цена = деталь.Цена;
	 Строка.Цена1 = деталь.Цена;
	 Строка.Количество = деталь.КолвоОстаток;
	 Строка.машина = деталь.машина;
	 //Строка.Стеллаж = деталь.Стеллаж;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСчетФактура(Команда)
	// Вставить содержимое обработчика.
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб = Истина;
	Макет       =   ПолучитьМакет("СчетФактура451");
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Номер = "Счет-фактура № "+Объект.Номер+" от "+Формат(Объект.Дата,"ДФ=""дд ММММ гггг""");
	ОбластьМакета.Параметры.ПредставлениеПоставщика = "Продавец: "+Объект.Организация.ПолноеНаименование+" ("+Объект.Организация.Наименование+")";
	ОбластьМакета.Параметры.АдресПоставщика = "Адрес: "+Объект.Организация.Адрес;
	ОбластьМакета.Параметры.ИННПоставщика = "ИНН/КПП продавца: "+Объект.Организация.ИНН;
	ОбластьМакета.Параметры.ПредставлениеГрузоотправителя = "Грузоотправитель и его адрес: он же";
	ОбластьМакета.Параметры.ПредставлениеГрузополучателя = "Грузополучатель и его адрес: " + Объект.Клиент.ПолноеНаименование + ", " + Объект.Клиент.ЮридическийАдрес;
	ОбластьМакета.Параметры.ПоДокументу = "К платежно-расчетному документу № -- от --";
	ОбластьМакета.Параметры.ПредставлениеПокупателя = "Покупатель: " + Объект.Клиент.ПолноеНаименование;
	ОбластьМакета.Параметры.АдресПокупателя = "Адрес: " + Объект.Клиент.ЮридическийАдрес;
	ОбластьМакета.Параметры.ИННПокупателя = "ИНН/КПП покупателя: "+Объект.Клиент.ИНН+"/"+Объект.Клиент.КПП;
	ТабДокумент.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ОбластьМакета.Параметры.Валюта = "Валюта: руб";
	ТабДокумент.Вывести(ОбластьМакета);
	ОбластьСтроки = Макет.ПолучитьОбласть("Строка");
	
	НомерСтроки = 0;
	Итого = 0;
	Скидка = 0;
	ндс = 0;
	Для Каждого СтрокаТабличнойЧасти Из Объект.Таблица Цикл

		НомерСтроки = НомерСтроки + 1;
		
		ОбластьСтроки.Параметры.ТоварНаименование = СтрокаТабличнойЧасти.Товар.Наименование;
		ОбластьСтроки.Параметры.ЕдиницаИзмерения = "шт";
		ОбластьСтроки.Параметры.Количество=СтрокаТабличнойЧасти.Количество;
		Скидка1 = 0;
		
		//ОбластьСтроки.Параметры.цена = СтрокаТабличнойЧасти.Цена;
		//ОбластьСтроки.Параметры.колво = СтрокаТабличнойЧасти.Количество;
		
		//Итого = Итого + СтрокаТабличнойЧасти.Цена*СтрокаТабличнойЧасти.Количество;
		Если СтрокаТабличнойЧасти.Скидка <> Null И СтрокаТабличнойЧасти.Скидка > 0 Тогда
			Скидка = Скидка + СтрокаТабличнойЧасти.Скидка;
			Скидка1 = СтрокаТабличнойЧасти.Скидка;
		Иначе
			Скидка = Скидка + (СтрокаТабличнойЧасти.Цена*СтрокаТабличнойЧасти.Количество)*(Объект.Клиент.Скидка/100);
			Скидка1 = (СтрокаТабличнойЧасти.Цена*СтрокаТабличнойЧасти.Количество)*(Объект.Клиент.Скидка/100);
		КонецЕсли;
		всего = СтрокаТабличнойЧасти.Цена*СтрокаТабличнойЧасти.Количество - Скидка1;
		Итого = Итого + всего;
		ОбластьСтроки.Параметры.Всего = СтрокаТабличнойЧасти.Цена*СтрокаТабличнойЧасти.Количество - Скидка1;
		ОбластьСтроки.Параметры.Акциз = "--";
		ОбластьСтроки.Параметры.СтавкаНДС = "18%";
		ОбластьСтроки.Параметры.Стоимость = всего/1.18;
		ндс = ндс + Окр((всего - всего/1.18),2);
		ОбластьСтроки.Параметры.СуммаНДС = всего - всего/1.18;
		ОбластьСтроки.Параметры.Цена = (всего - всего/1.18)/СтрокаТабличнойЧасти.Количество;
		ОбластьСтроки.Параметры.ПредставлениеСтраны = "--";
		ОбластьСтроки.Параметры.ПредставлениеГТД = "--"; 
		//ОбластьСтроки.Параметры.скидка = Скидка1; 
		
		ТабДокумент.Вывести(ОбластьСтроки);

	КонецЦикла;
    ОбластьМакета = Макет.ПолучитьОбласть("Итого");
	ОбластьМакета.Параметры.ИтогоВсего = Итого;
	ОбластьМакета.Параметры.ИтогоСуммаНДС = ндс;
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакета.Параметры.ФИОГлавногоБухгалтера = Объект.Организация.ФИО;
	ОбластьМакета.Параметры.ФИОПБОЮЛ = Объект.Организация.ФИО;
	ТабДокумент.Вывести(ОбластьМакета);
	
	ТабДокумент.Показать();
КонецПроцедуры

&НаКлиенте
Процедура ТоварнаяНакладная(Команда)
	// Вставить содержимое обработчика.
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.АвтоМасштаб = Истина;
	Макет       =   ПолучитьМакет("ТОРГ12");
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.ПредставлениеОрганизации = Объект.Организация.Наименование + ", ИНН " + Объект.Организация.ИНН + ", свидетельство " + Объект.Организация.Свидетельство + ", " + Объект.Организация.Адрес + ", тел. " + Объект.Организация.Телефон + ", р/с " + Объект.Организация.НомерСчета + ", в банке " + Объект.Организация.БанкПолучателя + ", БИК " +  Объект.Организация.БИК + ", к/с " + Объект.Организация.СчетБанка;
	ОбластьМакета.Параметры.ПредставлениеГрузополучателя = Объект.Клиент.ПолноеНаименование + ", ИНН " + Объект.Клиент.ИНН +", "+ Объект.Клиент.ЮридическийАдрес + ", тел. "+Объект.Клиент.РеквизитТелефон;
	ОбластьМакета.Параметры.ПредставлениеПоставщика = Объект.Организация.Наименование + ", ИНН " + Объект.Организация.ИНН + ", свидетельство " + Объект.Организация.Свидетельство + ", " + Объект.Организация.Адрес + ", тел. " + Объект.Организация.Телефон + ", р/с " + Объект.Организация.НомерСчета + ", в банке " + Объект.Организация.БанкПолучателя + ", БИК " +  Объект.Организация.БИК + ", к/с " + Объект.Организация.СчетБанка;
	ОбластьМакета.Параметры.ПредставлениеПлательщика = Объект.Клиент.ПолноеНаименование + ", ИНН " + Объект.Клиент.ИНН +", "+ Объект.Клиент.ЮридическийАдрес + ", тел. "+Объект.Клиент.РеквизитТелефон;
	ОбластьМакета.Параметры.Основание = "Основной договор";
	ОбластьМакета.Параметры.НомерДокумента = Объект.Номер;
	ОбластьМакета.Параметры.ДатаДокумента = Объект.Дата;
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьСтроки = Макет.ПолучитьОбласть("Строка");
	НомерСтроки = 0;
	Итого = 0;
	Скидка = 0;
	ндс = 0;
	
	СтрокНаСтранице = 20;
	СтрокШапки      = 10;
	СтрокПодвала    = 9;
	НомерСтраницы   = 1;
	
	ОбластьЗаголовка = Макет.ПолучитьОбласть("ЗаголовокТаб");
	ОбластьЗаголовка.Параметры.НомерСтраницы = "Страница "+НомерСтраницы;
    ТабДокумент.Вывести(ОбластьЗаголовка);
	ПроверкаПечати = Новый Массив;
	ПроверкаПечати.Добавить(ОбластьЗаголовка);
	
	КоличествоСтрок = Объект.Таблица.Количество();
	
	Если КоличествоСтрок <= 2 Тогда
		ПереноситьПоследнююСтроку = 0;
	Иначе
		ЦелыхСтраницСПодвалом     = Цел((СтрокШапки + КоличествоСтрок + СтрокПодвала) / СтрокНаСтранице);
		ЦелыхСтраницБезПодвала    = Цел((СтрокШапки + КоличествоСтрок - 1) / СтрокНаСтранице);
		ПереноситьПоследнююСтроку = ЦелыхСтраницСПодвалом - ЦелыхСтраницБезПодвала;
	КонецЕсли;
	
	ПереноситьПоследнюю = Ложь;
	
	// инициализация итогов по странице
	ИтогоМассаБруттоНаСтранице = 0;
	ИтогоМестНаСтранице        = 0;
	ИтогоКоличествоНаСтранице  = 0;
	ИтогоСуммаНаСтранице       = 0;
	ИтогоНДСНаСтранице         = 0;
	ИтогоСуммаСНДСНаСтранице   = 0;

	// инициализация итогов по документу
	ИтогоМассаБрутто = 0;
	ИтогоМест        = 0;
	ИтогоКоличество  = 0;
	ИтогоСуммаСНДС   = 0;
	ИтогоСумма       = 0;
	ИтогоНДС         = 0;
	Ном              = 0;

	
	Для Каждого СтрокаТабличнойЧасти Из Объект.Таблица Цикл

		НомерСтроки = НомерСтроки + 1;
		ОбластьСтроки.Параметры.Номер = ""+НомерСтроки; 
		ОбластьСтроки.Параметры.ТоварНаименование = СтрокаТабличнойЧасти.Товар.Наименование;
		ОбластьСтроки.Параметры.ТоварКод = СтрокаТабличнойЧасти.Товар.Код; 
		ОбластьСтроки.Параметры.БазоваяЕдиницаНаименование = "шт";
		ОбластьСтроки.Параметры.БазоваяЕдиницаКодПоОКЕИ = ""+796;
		ОбластьСтроки.Параметры.Количество=СтрокаТабличнойЧасти.Количество;
		Скидка1 = 0;
		
		//ОбластьСтроки.Параметры.цена = СтрокаТабличнойЧасти.Цена;
		//ОбластьСтроки.Параметры.колво = СтрокаТабличнойЧасти.Количество;
		
		//Итого = Итого + СтрокаТабличнойЧасти.Цена*СтрокаТабличнойЧасти.Количество;
		Если СтрокаТабличнойЧасти.Скидка <> Null И СтрокаТабличнойЧасти.Скидка > 0 Тогда
			Скидка = Скидка + СтрокаТабличнойЧасти.Скидка;
			Скидка1 = СтрокаТабличнойЧасти.Скидка;
		Иначе
			Скидка = Скидка + (СтрокаТабличнойЧасти.Цена*СтрокаТабличнойЧасти.Количество)*(Объект.Клиент.Скидка/100);
			Скидка1 = (СтрокаТабличнойЧасти.Цена*СтрокаТабличнойЧасти.Количество)*(Объект.Клиент.Скидка/100);
		КонецЕсли;
		всего = СтрокаТабличнойЧасти.Цена*СтрокаТабличнойЧасти.Количество - Скидка1;
		Итого = Итого + всего;
		ОбластьСтроки.Параметры.СуммаСНДС = СтрокаТабличнойЧасти.Цена*СтрокаТабличнойЧасти.Количество - Скидка1;
		//ОбластьСтроки.Параметры.Акциз = "--";
		ОбластьСтроки.Параметры.СтавкаНДС = "18%";
		ОбластьСтроки.Параметры.СуммаБезНДС = всего/1.18;
		ндс = ндс + Окр((всего - всего/1.18),2);
		ОбластьСтроки.Параметры.СуммаНДС = всего - всего/1.18;
		ОбластьСтроки.Параметры.Цена = (всего - всего/1.18)/СтрокаТабличнойЧасти.Количество;
		//ОбластьСтроки.Параметры.ПредставлениеСтраны = "--";
		//ОбластьСтроки.Параметры.ПредставлениеГТД = "--"; 
		//ОбластьСтроки.Параметры.скидка = Скидка1; 
		
		ПроверкаПечати.Добавить(ОбластьСтроки);
		
		Если Ном  =  Объект.Таблица.Количество() Тогда
			    ПроверкаПечатиПодвала = Новый Массив;
				
				ПроверкаПечатиПодвала.Добавить(ОбластьМакета);
			    ПроверкаПечатиПодвала.Добавить(Макет.ПолучитьОбласть("ИтогоПоСтранице"));
				
			    ПроверкаПечатиПодвала.Добавить(Макет.ПолучитьОбласть("Всего"));
			    ПроверкаПечатиПодвала.Добавить(Макет.ПолучитьОбласть("Подвал"));
		        Если Не ТабДокумент.ПроверитьВывод(ПроверкаПечатиПодвала) Тогда
					ПереноситьПоследнюю = Истина;
				КонецЕсли;	
			КонецЕсли;
			
		Если (ТабДокумент.ПроверитьВывод(ПроверкаПечати)) и Не переноситьПоследнюю Тогда
			ТабДокумент.Вывести(ОбластьСтроки);
			ИтогоМассаБруттоНаСтранице = ИтогоМассаБруттоНаСтранице;
			ИтогоМестНаСтранице        = ИтогоМестНаСтранице       ;
			ИтогоКоличествоНаСтранице  = ИтогоКоличествоНаСтранице  + СтрокаТабличнойЧасти.Количество;
			ИтогоСуммаНаСтранице       = ИтогоСуммаНаСтранице       + всего/1.18;
			ИтогоНДСНаСтранице         = ИтогоНДСНаСтранице         + Окр((всего - всего/1.18),2);
			ИтогоСуммаСНДСНаСтранице   = ИтогоСуммаСНДСНаСтранице   + всего;
				
			// увеличим итоги по дукументу
			ИтогоМассаБрутто = ИтогоМассаБрутто;
			ИтогоМест        = ИтогоМест       ;
			ИтогоКоличество  = ИтогоКоличество  + СтрокаТабличнойЧасти.Количество;;
			ИтогоСумма       = ИтогоСумма       + всего/1.18;
			ИтогоНДС         = ИтогоНДС         + Окр((всего - всего/1.18),2);
			ИтогоСуммаСНДС   = ИтогоСуммаСНДС   + всего;
		Иначе		

			ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");

			ОбластьИтоговПоСтранице.Параметры.ИтогМассаБруттоПоСтранице = ИтогоМассаБруттоНаСтранице;
			ОбластьИтоговПоСтранице.Параметры.ИтогМестПоСтранице        = ИтогоМестНаСтранице;
			ОбластьИтоговПоСтранице.Параметры.ИтогКоличествоПоСтранице  = ИтогоКоличествоНаСтранице;
			ОбластьИтоговПоСтранице.Параметры.ИтогСуммыПоСтранице       = ИтогоСуммаНаСтранице;
			ОбластьИтоговПоСтранице.Параметры.ИтогНДСПоСтранице         = ИтогоНДСНаСтранице;
			ОбластьИтоговПоСтранице.Параметры.ИтогСуммыСНДСПоСтранице   = ИтогоСуммаСНДСНаСтранице;

			ТабДокумент.Вывести(ОбластьИтоговПоСтранице);
			
			ПроверкаПечати.Очистить();
			
			НомерСтраницы = НомерСтраницы + 1;
				
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				
			ОбластьЗаголовка.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
				
			ПроверкаПечати.Добавить(ОбластьЗаголовка);
			ТабДокумент.Вывести(ОбластьЗаголовка);
				
				
				// очистим итоги по странице
			ИтогоМассаБруттоНаСтранице = 0;
			ИтогоМестНаСтранице        = 0;
			ИтогоКоличествоНаСтранице  = 0;
			ИтогоСуммаНаСтранице       = 0;
			ИтогоНДСНаСтранице         = 0;
			ИтогоСуммаСНДСНаСтранице   = 0;


			ПроверкаПечати.Добавить(ОбластьСтроки);
			ТабДокумент.Вывести(ОбластьСтроки);
			ИтогоМассаБруттоНаСтранице = ИтогоМассаБруттоНаСтранице;
			ИтогоМестНаСтранице        = ИтогоМестНаСтранице       ;
			ИтогоКоличествоНаСтранице  = ИтогоКоличествоНаСтранице  + СтрокаТабличнойЧасти.Количество;
			ИтогоСуммаНаСтранице       = ИтогоСуммаНаСтранице       + всего/1.18;
			ИтогоНДСНаСтранице         = ИтогоНДСНаСтранице         + Окр((всего - всего/1.18),2);
			ИтогоСуммаСНДСНаСтранице   = ИтогоСуммаСНДСНаСтранице   + всего;

				// увеличим итоги по дукументу
			ИтогоМассаБрутто = ИтогоМассаБрутто;
			ИтогоМест        = ИтогоМест       ;
			ИтогоКоличество  = ИтогоКоличество  + СтрокаТабличнойЧасти.Количество;
			ИтогоСумма       = ИтогоСумма       + всего/1.18;
			ИтогоНДС         = ИтогоНДС         + Окр((всего - всего/1.18),2);
			ИтогоСуммаСНДС   = ИтогоСуммаСНДС   + всего;
				

				
			КонецЕсли;
	КонецЦикла;

	// Выводим итоги по последней странице
	ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
	ОбластьИтоговПоСтранице.Параметры.ИтогМассаБруттоПоСтранице = ИтогоМассаБруттоНаСтранице;
	ОбластьИтоговПоСтранице.Параметры.ИтогМестПоСтранице        = ИтогоМестНаСтранице;
	ОбластьИтоговПоСтранице.Параметры.ИтогКоличествоПоСтранице  = ИтогоКоличествоНаСтранице;
	ОбластьИтоговПоСтранице.Параметры.ИтогСуммыПоСтранице       = ИтогоСуммаНаСтранице;
	ОбластьИтоговПоСтранице.Параметры.ИтогНДСПоСтранице         = ИтогоНДСНаСтранице;
	ОбластьИтоговПоСтранице.Параметры.ИтогСуммыСНДСПоСтранице   = ИтогоСуммаСНДСНаСтранице;

	ТабДокумент.Вывести(ОбластьИтоговПоСтранице);
	
	// Выводим итоги по документу в целом
	ОбластьМакета = Макет.ПолучитьОбласть("Всего");
	ОбластьМакета.Параметры.ИтогМассаБрутто = ИтогоМассаБрутто;
	ОбластьМакета.Параметры.ИтогМест        = ИтогоМест;
	ОбластьМакета.Параметры.ИтогКоличество  = ИтогоКоличество;
	ОбластьМакета.Параметры.ИтогСуммы       = ИтогоСумма;
	ОбластьМакета.Параметры.ИтогНДС         = ИтогоНДС;
	ОбластьМакета.Параметры.ИтогСуммыСНДС   = ИтогоСуммаСНДС;

	ТабДокумент.Вывести(ОбластьМакета);

	// Выводим подвал документа
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");

	ОбластьМакета.Параметры.ФИОРуководителя       = Объект.Организация.ФИО;
	ОбластьМакета.Параметры.ФИОГлавБухгалтера     = Объект.Организация.ФИО;
	ОбластьМакета.Параметры.ДолжностьРуководителя = "Директор";

	Если ИтогоМест > 0 Тогда
		ОбластьМакета.Параметры.ВсегоМестПрописью = ЧислоПрописью(ИтогоМест, ,",,,,,,,,0");
	КонецЕсли;

	ОбластьМакета.Параметры.КоличествоПорядковыхНомеровЗаписейПрописью = ЧислоПрописью(КоличествоСтрок, ,",,,,,,,,0");
	ОбластьМакета.Параметры.СуммаПрописью = ЧислоПрописью(ИтогоСуммаСНДС,,"рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
	
	
	ТабДокумент.Вывести(ОбластьМакета);

	// Зададим параметры макета
	ТабДокумент.ПолеСверху              = 0;
	ТабДокумент.ПолеСлева               = 0;
	ТабДокумент.ПолеСнизу               = 0;
	ТабДокумент.ПолеСправа              = 0;
	ТабДокумент.РазмерКолонтитулаСверху = 0;
	ТабДокумент.РазмерКолонтитулаСнизу  = 0;
	ТабДокумент.АвтоМасштаб             = Истина;
	ТабДокумент.ОриентацияСтраницы      = ОриентацияСтраницы.Ландшафт;


	ТабДокумент.Показать();
КонецПроцедуры

&НаКлиенте
Процедура СчетНаОплату(Команда)
	// Вставить содержимое обработчика.
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.АвтоМасштаб = Истина;
	Макет       =   ПолучитьМакет("СчетЗаказ1");
	ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокСчета");
	ОбластьМакета.Параметры.БанкПолучателяПредставление = Объект.Организация.БанкПолучателя;
	ОбластьМакета.Параметры.БИКБанкаПолучателя = Объект.Организация.БИК;
	ОбластьМакета.Параметры.СчетБанкаПолучателяПредставление = Объект.Организация.СчетБанка;
	ОбластьМакета.Параметры.ИННПолучателя = Объект.Организация.ИНН;
	ОбластьМакета.Параметры.КПППолучателя = Объект.Организация.КПП;
	ОбластьМакета.Параметры.СчетПолучателяПредставление = Объект.Организация.НомерСчета;
	ОбластьМакета.Параметры.ПредставлениеПолучателя = Объект.Организация.Наименование;
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстЗаголовка = "Счет на оплату № " + Объект.Номер+" от "+Формат(Объект.Дата,"ДФ=""дд ММММ гггг"""); 
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	поставшик = Объект.Организация.Наименование+ ", ИНН " + Объект.Организация.ИНН;  
	Если СтрДлина(Объект.Организация.КПП)>3 Тогда
		поставшик = поставшик + ", КПП " + Объект.Организация.КПП;
	КонецЕсли;
	ОбластьМакета.Параметры.ПредставлениеПоставщика = поставшик + ", " + Объект.Организация.Адрес + ", тел. " + Объект.Организация.Телефон;
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	покупатель = Объект.Клиент.ПолноеНаименование + ", ИНН " + Объект.Клиент.ИНН;
	Если СтрДлина(Объект.Клиент.КПП)>3 Тогда
		покупатель = покупатель + ", КПП " + Объект.Клиент.КПП;
	КонецЕсли;
	ОбластьМакета.Параметры.ПредставлениеПокупателя = покупатель  +", "+ Объект.Клиент.ЮридическийАдрес + ", тел. "+Объект.Клиент.РеквизитТелефон;
	ТабДокумент.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьСтроки = Макет.ПолучитьОбласть("Строка");
	
	НомерСтроки = 0;
	Итого = 0;
	Скидка = 0;
	ндс = 0;
	Для Каждого СтрокаТабличнойЧасти Из Объект.Таблица Цикл

		НомерСтроки = НомерСтроки + 1;
		
		ОбластьСтроки.Параметры.НомерСтроки = ""+НомерСтроки;
		ОбластьСтроки.Параметры.Товар = СтрокаТабличнойЧасти.Товар.Наименование;
		ОбластьСтроки.Параметры.ЕдиницаИзмерения = "шт";
		ОбластьСтроки.Параметры.Количество=""+СтрокаТабличнойЧасти.Количество;
		Скидка1 = 0;
		
		//ОбластьСтроки.Параметры.цена = СтрокаТабличнойЧасти.Цена;
		//ОбластьСтроки.Параметры.колво = СтрокаТабличнойЧасти.Количество;
		
		//Итого = Итого + СтрокаТабличнойЧасти.Цена*СтрокаТабличнойЧасти.Количество;
		Если СтрокаТабличнойЧасти.Скидка <> Null И СтрокаТабличнойЧасти.Скидка > 0 Тогда
			Скидка = Скидка + СтрокаТабличнойЧасти.Скидка;
			Скидка1 = СтрокаТабличнойЧасти.Скидка;
		Иначе
			Скидка = Скидка + (СтрокаТабличнойЧасти.Цена*СтрокаТабличнойЧасти.Количество)*(Объект.Клиент.Скидка/100);
			Скидка1 = (СтрокаТабличнойЧасти.Цена*СтрокаТабличнойЧасти.Количество)*(Объект.Клиент.Скидка/100);
		КонецЕсли;
		всего = СтрокаТабличнойЧасти.Цена*СтрокаТабличнойЧасти.Количество - Скидка1;
		Итого = Итого + всего;
		ОбластьСтроки.Параметры.Сумма = СтрокаТабличнойЧасти.Цена*СтрокаТабличнойЧасти.Количество - Скидка1;
		ндс = ндс + Окр((всего - всего/1.18),2);
		ОбластьСтроки.Параметры.Цена = всего/СтрокаТабличнойЧасти.Количество;
		//ОбластьСтроки.Параметры.скидка = Скидка1; 
		
		ТабДокумент.Вывести(ОбластьСтроки);

	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Итого");
	ОбластьМакета.Параметры.Всего = ""+Итого; 
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ИтогоНДС");
	ОбластьМакета.Параметры.ВсегоНДС = ""+ндс;
	ОбластьМакета.Параметры.НДС = "В том числе НДС: ";
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ИтогоКОплате");
	ОбластьМакета.Параметры.ИтогоКОплате = ""+Итого; 
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
	ОбластьМакета.Параметры.ИтоговаяСтрока = "Всего наименований "+Объект.Таблица.Количество() + ", на сумму "+Итого;
	ОбластьМакета.Параметры.СуммаПрописью = ЧислоПрописью(Итого,,"рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");                     
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ПодвалСчета");
	ОбластьМакета.Параметры.ФИОРуководителя = Объект.Организация.ФИО;
	ТабДокумент.Вывести(ОбластьМакета);
	  
	
	ТабДокумент.Показать();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	Сообщить("!!1");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		Объект.Таблица.Сортировать("Товар Убыв");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Параметры.Ключ.Пустая() Тогда
		Объект.КтоПродал = НайтиПользователя();
	КонецЕсли;
	Если ПолностьюОплачено() Тогда
		Элементы.УжеОплачено.Видимость = Ложь;
	Иначе
		Элементы.УжеОплачено.Видимость = Истина;
	КонецЕсли

КонецПроцедуры

&НаСервере
Функция НайтиПользователя()
	// ++ obrv 16.01.18
	//Возврат Справочники.Пользователи.НайтиПоНаименованию(ИмяПользователя());
	Возврат ПользователиКлиентСервер.ТекущийПользователь();
	// -- obrv 16.01.18
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОплаченоПриИзменении(Элемент)
	Если ПолностьюОплачено() Тогда
		Элементы.УжеОплачено.Видимость = Ложь;
	Иначе
		Элементы.УжеОплачено.Видимость = Истина;
	КонецЕсли
КонецПроцедуры
	
Функция ПолностьюОплачено()
	Возврат Объект.Оплачено;
КонецФункции

&НаКлиенте
Процедура ПосчитатьИтого(Команда)
	// Вставить содержимое обработчика.
	ПосчитатьИтоги();
КонецПроцедуры

&НаСервере
Процедура ПосчитатьИтоги()
// регистр ИнформацияОПродажах Приход
	ИтогоОбщ = 0;
	СкидкаОбщ = 0;

	Для Каждого ТекСтрокаТаблица Из Объект.Таблица Цикл
		Скидка = 0;
		ИтогоОбщ = ИтогоОбщ + ТекСтрокаТаблица.Цена*ТекСтрокаТаблица.Количество;
		Если ТекСтрокаТаблица.Скидка <> Null И ТекСтрокаТаблица.Скидка > 0 Тогда
			Скидка = ТекСтрокаТаблица.Скидка;
			СкидкаОбщ = СкидкаОбщ + ТекСтрокаТаблица.Скидка;
		Иначе
			Скидка = ТекСтрокаТаблица.Цена*(Объект.Клиент.Скидка/100);
			СкидкаОбщ = СкидкаОбщ + (ТекСтрокаТаблица.Цена*ТекСтрокаТаблица.Количество)*(Объект.Клиент.Скидка/100);
		КонецЕсли;
	КонецЦикла;
	
	Объект.ИтогоРекв = ИтогоОбщ - СкидкаОбщ;
	
КонецПроцедуры

&НаКлиенте
Процедура НарядНаСборку(Команда)
	
	ТабДокумент = НарядНаСборкуСервер();
	ТабДокумент.Показать();
КонецПроцедуры


// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервере
Функция НарядНаСборкуСервер()

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб = Истина;
	Макет       =   ПолучитьМакет("НарядНаСборку");
	ОбластьМакета = Макет.ПолучитьОбласть("шапка");
	ОбластьМакета.Параметры.заголовок = "Наряд на сборку №"+Объект.Номер;
	ТабДокумент.Вывести(ОбластьМакета);
	ОбластьСтроки = Макет.ПолучитьОбласть("строка");
	
	Для Каждого СтрокаТабличнойЧасти Из Объект.Таблица Цикл
		ОбластьСтроки.Параметры.код = СтрокаТабличнойЧасти.Товар.Код; 
		ОбластьСтроки.Параметры.артикул = СтрокаТабличнойЧасти.Товар.Артикул;
		ОбластьСтроки.Параметры.название = СтрокаТабличнойЧасти.Товар.Наименование;
		ОбластьСтроки.Параметры.колво = СтрокаТабличнойЧасти.Количество;
		ОбластьСтроки.Параметры.место = СтрокаТабличнойЧасти.Товар.МестоНаСкладе;
		ТабДокумент.Вывести(ОбластьСтроки);

	КонецЦикла;
	
	Возврат ТабДокумент;

КонецФункции // НарядНаСборкуСервер()

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОстаткиИзменение");
КонецПроцедуры
